; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph4 - mode
	infrared3 - mode
	infrared1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph4)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph4)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 Star4)
	(supports instrument7 spectrograph2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument8 infrared1)
	(supports instrument8 infrared3)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star5)
	(supports instrument9 infrared1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation3)
	(calibration_target instrument9 GroundStation0)
	(supports instrument10 infrared3)
	(supports instrument10 infrared1)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
)
(:goal (and
	(pointing satellite2 GroundStation2)
	(pointing satellite3 GroundStation2)
	(have_image Planet7 infrared3)
	(have_image Planet8 spectrograph2)
	(have_image Phenomenon9 spectrograph2)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 thermograph4)
))

)

; plan
1. (turn_to satellite3 star5 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star5)
   goals met: 0 of 7
2. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 7
3. (calibrate satellite3 instrument8 star5)
   added: (calibrated instrument8)
   goals met: 0 of 7
4. (turn_to satellite3 planet7 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 planet7)
   goals met: 0 of 7
5. (take_image satellite3 planet7 instrument8 infrared3)
   added: (have_image planet7 infrared3)
   goals met: 1 of 7
6. (turn_to satellite3 phenomenon10 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 phenomenon10)
   goals met: 1 of 7
7. (turn_to satellite2 groundstation2 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation2)
   goals met: 2 of 7
8. (turn_to satellite0 star1 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star1)
   goals met: 2 of 7
9. (take_image satellite3 phenomenon10 instrument8 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 3 of 7
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
11. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 3 of 7
12. (turn_to satellite0 phenomenon11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 7
13. (take_image satellite0 phenomenon11 instrument0 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 4 of 7
14. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 7
15. (take_image satellite0 phenomenon9 instrument0 spectrograph2)
   added: (have_image phenomenon9 spectrograph2)
   goals met: 5 of 7
16. (turn_to satellite0 planet8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet8)
   goals met: 5 of 7
17. (take_image satellite0 planet8 instrument0 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 6 of 7
18. (turn_to satellite3 groundstation2 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 groundstation2)
   goals met: 7 of 7
